一，选择题（每题2分，共30分）
1、以下说法正确的是：

A、Python中str的单引号与双引号有区别

B、python3x版本默认编码方式为unicode。
C、Python设置变量可以为and。

D、Python3x版本中的input输入的字符串类型。

答案选D
2、此代码的运行结果为：

while flag:
    print(1)
    print(2)
    flag = False
    print(4)
A、1
2
B、1
2
1
2.....C、1
2
4
D、1
2
4
1
2
4........

答案选C

3、下面代码的结果为：
name = ‘alex’
a = ‘3’
print(name * a)
A、alexalexalex
B、 alex3
C、3
alex
D、TypeError

答案选D

4、以下说法错误的是：

A、ASCII码只包含数字，字母，特殊字符。

B、unicode有两个版本，第一个版本是一个字符用两个字节表示，第二个版本是一个字符用四个字节表示。
C、utf - 8
中，一个字节用三个字符表示。

D、gbk只包含英文，数字，特殊字符，和中文。

答案选C

5、计算一下这个不等式的结果：
1 > 2 and 3 or 6
A、True
B.
False
C.
3
D
.6

答案选D

6、‘老男孩’用utf - 8
编码需要几个字节表示？
A、3
B、6
C、9
D、12

答案选C

7、在Python3x中：a = b‘alex’，如何将a转化成 ‘alex’？
A、a.encode(‘utf - 8’)  B、a.decode()
C、bytes(a)
D、str（a）

答案选B

8、count在内存中最终等于：

count = 1
while count < 9:
    print(count)
count += 1
A
.7
B
.8
C
.9
D
.6

答案选C

9、以下叙述正确的是：
A、continue语句的作用是结束整个循环的执行
B、只能在循环体内使用break语句
C、在循环体内使用break语句或continue语句的作用相同
D、从多层循环嵌套中退出时，只能使用quit语句

答案选B

10、a = ‘老男孩教育’，a[:6]
的结果为:
A、‘老男孩教育’ B、‘’  C、TypeError
D、‘老男孩教育老男’

答案选A

11、下列说法正确的是(多选)：
A，字符串的capitalize()
为首字母大写，其余字母小写。
B，列表的pop为通过索引删除，且有返回值。
C，字典的remove为通过键删除字典的键值对。
D，元组为只读列表，只能进行增和查。

答案选A，B

12、下列表达正确的是(多选)：
A、字典中的keys（）方法是将字典的所有键都存放至一个列表中。
B、给一个列表extend（‘ab3’）实际上是添加了a，b, 3
三个字符串。
C、s1 =‘alex @’，s2 =‘alex @’，print(s1 is s2)
为True。
D、‘abc’.encode(‘utf - 8’).decode(‘gbk’) 结果为‘abc’。

答案选：A,B,C,D

13、下列表达正确的是（多选）：
A、a =（1，） a为int类型。
B、l1 = [1, 2, 3]
l2 = l1
l1.append(666)
print(l2)
结果为[1, 2, 3，666]
C、l1 = [22, 33, 44]
l2 = l1[:]
l1与l2的关系为浅copy。
D、集合是无序的不重复的，里面的元素要求是不可哈希的。

14、选出你认为正确的答案（多选）：
A、在文件操作中，r + 模式只能读写，不能写读。
B、函数是以功能为导向的。
C、文件操作中，将光标移动至末尾是seek（0, 1）。
D、函数的 * args在默认参数前面。
15、下列说法正确的是（多选）：
A、函数的return的是将值返回给函数名。
B、函数的实参的位置参数在关键字参数前面。
C、全局作用域包含内置名称空间和局部名称空间。
D、函数名被视为第一类对象。
二，填空题（10
分）。

def calc(a, b, c, d=1, e=2):
    return a + b + c - d - e


请分别写出下列标号代码的输出结果，如果出错请写出Error。
print(calc(1, 2, 3, 4, 5))
_____
print(calc(1, 2))
____
print(calc(e=4, c=5, a=2, b=3))
___
print(calc(1, 2, 3))
_____
print(calc(1, 2, 3, d=5, 4))
_____

获取list的元素个数，和向末尾追加元素所用的方法是____, ____.

不依赖中间变量，交换变量a和b的值得表达式是_________________________.

list = [1, 2, 3, 4, 5]
print(list[10:])
答案是什么？____________.

如何通过一行语句创建一个这样的字典
{1: 'alex', 2: 'alex', 3: 'alex'}？
不能直接写dic = {1: 'alex', 2: 'alex', 3: 'alex'})
____________________________.
    三，简答题（共20分）
1、 is 和 == 的区别 （1
分）

2、Python
如何实现tuple和list的转换。（1
分）

3、list和tuple有什么不同 （1
分）

4、*args和 ** kwargs在什么情况下会使到？请给出使 ** kwargs的事例（2
分）

5、Python中什么数据类型存在小数据池？小数据池有什么作用？（1
分）

6、在Python3x版本中，s1 = ‘老男孩’，如何将s1转化成utf - 8
的bytes类型？转化成功之后，得到了s2，如何将s2转化成gbk的bytes类型（请写出具体代码）？（2
分）

7、下面代码有没有问题？如果有问题请指出来（2
分）？
f = open('a.txt', encoding='utf-8')
f.write('666')

8、l = [1, 1, 2, 2, 3, 4, 5, 5, 6, 6, 7, 8]
将此列表去重。（1
分）

9、有如下代码，写出最后结果，并解释为什么。（2
分）
l1 = [1, [22, 33, 44], 3, 4, ]
l2 = l1
l3 = l1.copy()
l1.append(666)
l1[1].append('55')
Print(l1, l2, l3)

10、‘1, 2, 3’如何变成[‘1’, ’2’, ’3’]？ [‘1’, ’2’, ’3’]如何变成[1, 2, 3]?（写具体代码）（2
分）

11、什么是闭包（closure），为什么要用它？（2
分）

12，global有什么用？nonlocal又是干什么的？（2
分）

13，如何终止while循环？（1
分）


四，编程题。

1、有文件t1.txt里面的内容为：（6
分）

1, alex, 22, 13651054608, IT
2, wusir, 23, 13304320533, Tearcher
3, taibai, 18, 1333235322, IT

利用文件操作，将其构造成如下数据类型。
[{'id': '1', 'name': 'alex', 'age': '22', 'phone': '13651054608', 'job': 'IT'}, ......]

2、写函数，完成以下功能：（6
分）
用户将文件名（文件前提必须存在），操作方法（只有r, w, a三种）传入此函数，此函数按照传入的参数完成相应的操作。
例如：
def func(path, mode, *args):
    pass


func(‘a.txt’, ’r’) 此函数完成的就是以读的模式打开a.txt文件，并打印出来。
func(‘a.txt’, ’w’, ’老男孩教育’)此函数完成的就是以写的模式打开a.txt文件，将内容写入。
func(‘a.txt’, ’a’, ’老男孩教育’)此函数完成的就是以追加的模式打开a.txt文件，将内容追加。



3、写函数完成以下功能：（6
分）
给函数传入一个列表（此列表里面的元素必须全部是str类型），将列表中的每个元素按照顺序依次加上他们的索引，形成新的元素，并添加到一个新列表，将新列表返回。
例如：给函数传入一个列表[‘alex’, ’太白’]，
返回值为[‘alex0’, ’太白1’]

4，写一个函数，完成注册的功能，将用户名，密码写入到文件中（用户名不能重复，如果重复提示他重新输入）。再写一个函数，完成三次登录功能，账号密码从注册的文件中获取。（12
分）

5、编写装饰器，为多个函数加上认证的功能（用户名密码存在文件中，只有一个），要求登录成功一次（给三次机会），后续的函数都无需再输入用户名和密码。（10
分）
